In [1]:
import pandas as pd

In [12]:
df = pd.read_csv('data/training.1600000.processed.noemoticon.csv', sep=',', encoding='latin-1', names=['target', 'ids', 'date', 'flag', 'user', "text"])

*     target: the polarity of the tweet (0 = negative, 2 = neutral, 4 = positive)
*     ids: The id of the tweet ( 2087)
*     date: the date of the tweet (Sat May 16 23:58:44 UTC 2009)
*     flag: The query (lyx). If there is no query, then this value is NO_QUERY.
*     user: the user that tweeted (robotickilldozr)
*     text: the text of the tweet (Lyx is cool)

In [13]:
df.head(3)

,target,ids,date,flag,user,text
0,0,1467810369,Mon Apr 06 22:19:45 PDT 2009,NO_QUERY,_TheSpecialOne_,"@switchfoot http://twitpic.com/2y1zl - Awww, t..."
1,0,1467810672,Mon Apr 06 22:19:49 PDT 2009,NO_QUERY,scotthamilton,is upset that he can't update his Facebook by ...
2,0,1467810917,Mon Apr 06 22:19:53 PDT 2009,NO_QUERY,mattycus,@Kenichan I dived many times for the ball. Man...

data contains 1600000

In [14]:
df.shape

(1600000, 6)

In [22]:
df.groupby('user').count()

                 target  ids  date  flag  text
user
000catnap000          6    6     6     6     6
000matthewkelly       1    1     1     1     1
000yea000             1    1     1     1     1
0010x0010             1    1     1     1     1
001BabyGirl           2    2     2     2     2
...                 ...  ...   ...   ...   ...
zzztar                2    2     2     2     2
zzzum                 1    1     1     1     1
zzzunzinnn            3    3     3     3     3
zzzyourdreamzzz       1    1     1     1     1
zzzzeus111            1    1     1     1     1

[659775 rows x 5 columns]